import { Box, Typography, Paper } from "@mui/material";

const HomePage = () => {
  return (
    <Box
      sx={{
        padding: "2rem",
        maxWidth: "900px",
        margin: "auto",
      }}
    >
      <Paper
        elevation={3}
        sx={{
          padding: "2rem",
          borderRadius: "8px",
          backgroundColor: "#f9f9f9",
          overflow: "auto",
        }}
      >
        <Typography variant="h6" gutterBottom>
          Претрага репозиторијума
        </Typography>
        <Typography variant="body1" paragraph>
          Уз ослонац на ElasticSearch платформу имплементирати претрагу колекције достављених уговора и закона.
          Закон се посматра као full-text. Док је из уговора потребно парсирати следеће податке: име и презиме запосленог
          који је потписник уговора, назив владе, ниво управе, адреса владе. Све документе у сировом облику (ПДФ фајл)
          чувати у MinIO бази и приликом приказа резултата омогућити њихово преузимање. Креирати форму за задавање упита:
        </Typography>

        <Typography variant="body1" paragraph>
          ● Претраживање уговора по имену и презимену запосленог који је потписник уговора,
          ● Претраживање уговора према називу владе и нивоу управе,
          ● Претраживање докумената према садржају уговора (full-text search из ПДФ фајла),
          ● Претраживање докумената према садржају закона (full-text search из ПДФ фајла),
          ● Комбинација претходних параметара претраге (BooleanQuery, омогућити и AND, OR и NOT оператор између поља,
          приоритет ових оператора треба да буде исти као у неком C-like програмском језику).
          ● Обезбедити подршку и за задавање PhrazeQuery-а у свим пољима.
          ● Претпроцесирати упит помоћу SerbianAnalyzer-а.
          ● Приликом приказа резултата креирати динамички сажетак (Highlighter).
          ● Обезбедити претрагу уговора по геолокацији владе
          ○ Задаје се име града (може и адреса) и радијус у оквирu којег ћемо да тражимо уговоре (управе)
        </Typography>

        <Typography variant="body1" paragraph>
          У Kibana-и је потребно направити следеће визуализације:
          ● из којег града је било највише потписаних уговора са управом (владом),
          ● који запослени има највише потписаних уговора,
          ● која управа (влада) има највише потписаних уговора.
        </Typography>
      </Paper>
    </Box>
  );
};

export default HomePage;
